clc;
clear;
close all;
y=[ 112.1734 109.1572 141.7024 167.9674 218.9323 263.5224 294.9719 550.5155 ];
value = [1 2 3 4 5 6 7 8];
name = {'罗湖区',	'福田区',	'南山区',	'宝安区',	'龙岗区',	'盐田区',	'光明新区',	'坪山新区'};
bar(value,y)
set(gca, 'XTickLabel', name);
figure;

yy=[ 0.512  0.41 1-0.512-0.41];
explode=[0 0 1];
pie(yy,explode,{'OFO','摩拜','其他'})
gtext('51.2%');
gtext('41%');
gtext('7.8%');
figure;
figure;

yy=[ 0.542  0.458];
explode=[0 1];
pie(yy,explode,{'男性','女性'})
gtext('54.2%');
gtext('45.8%');


b_city=[ 12.7 9.7 8.9 8.4 7.1 3.4 1.1 0.3 0.3 0.1 ];
value = [1 2 3 4 5 6 7 8 9 10];
name={'宝安','南山','福田','罗湖','龙华','龙岗','光明','盐田','坪山','大鹏'};
bar(value,b_city)
set(gca, 'XTickLabel', name);


figure;
y3=[ 54.87  2.35  33.17 8.25   1.35];
explode=[ 0 0 0 0 0 ];
pie(y3,explode,{ '20-30','20岁以下', '30-40', '40-50岁', '50岁以上'});
figure;
y4=[ 37.14  4.12 40.62 14.28 3.85 ];
explode=[ 0 0 0 0 0 ];
pie(y4,explode,{ '6万以下', '20-30万','6-12万', '12-20万', '30万以上'});

clc;
clear;
close all;
y=[ 54 107 284 446 484 809  1149 2228 4194 5760 6973 ];
value=[1:11];
date={'2016-7','2016-8','2016-9','2016-10','2016-11','2016-12','2017-1','2017-2','2017-3','2017-4','2017-5' };
bar(value,y)
set(gca, 'XTickLabel', date);
axis([0,12 ,0,7500]);
xlabel('时间');
ylabel('活跃用户数（单位万）');
for i=1:11
    gtext( num2str(y(i)) );
end

x=[ 1149 2228 4194 5760 6973 ];
222



clc;
clear;
close all;
x=[ 144.06	97.56	129.12	22.12	286.33	205.24	151.15	35.61	53.12	13.56  ];
y1=x./1137.87;
b_city=[ 12.7  9.7    8.9    8.4    7.1    3.4    1.1   0.3    0.3    0.1 ];
y=y1*1052;
value=[1:10];
city={'福田区','罗湖区','南山区','盐田区','宝安区','龙岗区','龙华区','坪山区','光明新区','大鹏新区'},
bar(value,y)
set(gca, 'XTickLabel', city);
axis([0,11 ,0,300]);
xlabel('区');
ylabel('注册用户数（单位万）');
for i=1:10
    gtext( num2str(y(i)) );
end						


clc;
clear; 
close all;
b_city=[  8.9 8.4 9.7 0.3  12.7  3.4 7.1 0.3  1.1  0.1];
s_city=[ 78.66	78.76	185.49	74.64	398.38	387.82	175.58	167.01	155.45	295.06   ];
p=b_city*10000*0.8./s_city

clc;
clear; 
close all;
p_city=[ 133.19 	90.20 	119.38 	20.45 	264.72 	189.75 	139.74 	32.92 	49.11 	12.54  ];
s_city=[ 78.66	78.76	185.49	74.64	398.38	387.82	175.58	167.01	155.45	295.06   ];
pu=p_city*10000./s_city


clc;
clear; 
close all;
x=[16932.37 	11452.51 	6435.93 	2739.82 	6644.91 	4892.73 	7958.77 	1971.14 	3159.22 	425.00 ];
y=[ 905.16 	853.22 	418.35 	32.15 	255.03 	70.14 	323.50 	14.37 	56.61 	2.71  ];
z=x./y



clc;
clear;
close all;
h=[18.71 	13.42 	15.38 	85.22 	26.06 	69.76 	24.60 	137.17 	55.81 	156.83   ];
city={'福田区','罗湖区','南山区','盐田区','宝安区','龙岗区','龙华区','坪山区','光明新区','大鹏新区'},
value=[1:10 ];
bar(value, h );
set(gca, 'XTickLabel', city);
axis([0,11 ,0,180]);
xlabel('区');
ylabel('共享度（单位：人/辆）');
for i=1:10
    gtext( num2str(h(i)) );
end		










